sterentev/atdf-device-asm-include/inc/ATmega128RFA1.inc
; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC1B		= 6		; 0x40 - Force Output Compare for Channel B
.equ	FOC1C		= 5		; 0x20 - Force Output Compare for Channel C
.equ	TCCR1C_Res_MASK	= 0x1F		;      - Reserved (5 bits)
.equ	TCCR1C_Res0	= 0		;          TCCR1C_Res BIT0 position

; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 5		; 0x20 - Timer/Counter1 Input Capture Interrupt Enable
.equ	OCIE1C		= 3		; 0x08 - Timer/Counter1 Output Compare C Match Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 5		; 0x20 - Timer/Counter1 Input Capture Flag
.equ	OCF1C		= 3		; 0x08 - Timer/Counter1 Output Compare C Match Flag
.equ	OCF1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Flag
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Flag
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag



; ====	TRX24 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register AES_CTRL bits		------------------------
.equ	AES_REQUEST	= 7		; 0x80 - Request AES Operation.
.equ	AES_MODE	= 5		; 0x20 - Set AES Operation Mode
.equ	AES_DIR		= 3		; 0x08 - Set AES Operation Direction
.equ	AES_IM		= 2		; 0x04 - AES Interrupt Enable
; ::::  AES_MODE	:::: bitfield values
;			0x00		; AES Mode is ECB (Electronic Code Book).
;			0x20		; AES Mode is CBC (Cipher Block Chaining).
; ::::  AES_DIR	:::: bitfield values
;			0x00		; AES operation is encryption.
;			0x08		; AES operation is decryption.

; ----------	Register AES_STATUS bits	------------------------
.equ	AES_ER		= 7		; 0x80 - AES Operation Finished with Error
.equ	AES_STATUS_Res_MASK= 0x7E		;      - Reserved (6 bits)
.equ	AES_STATUS_Res0	= 1		;          AES_STATUS_Res BIT0 position
.equ	AES_DONE	= 0		; 0x01 - AES Operation Finished with Success

; ----------	Register AES_STATE bits		------------------------
.equ	AES_STATE_MASK	= 0xFF		;      - AES Plain and Cipher Text Buffer (8 bits)
.equ	AES_STATE0	= 0		;          AES_STATE BIT0 position

; ----------	Register AES_KEY bits		------------------------
.equ	AES_KEY_MASK	= 0xFF		;      - AES Encryption/Decryption Key Buffer (8 bits)
.equ	AES_KEY0	= 0		;          AES_KEY BIT0 position

; ----------	Register TRX_STATUS bits	------------------------
.equ	CCA_DONE	= 7		; 0x80 - CCA Algorithm Status
.equ	CCA_STATUS	= 6		; 0x40 - CCA Status Result
.equ	TST_STATUS	= 5		; 0x20 - Test mode status
.equ	TRX_STATUS_MASK	= 0x1F		;      - Transceiver Main Status (5 bits)
.equ	TRX_STATUS0	= 0		;          TRX_STATUS BIT0 position
; ::::  CCA_DONE	:::: bitfield values
;			0x00		; CCA calculation not finished
;			0x80		; CCA calculation finished
; ::::  CCA_STATUS	:::: bitfield values
;			0x00		; Channel indicated as busy.
;			0x40		; Channel indicated as idle.
; ::::  TST_STATUS	:::: bitfield values
;			0x00		; Test mode is disabled.
;			0x20		; Test mode is active.
; ::::  TRX_STATUS	:::: bitfield values
;			0x00		; P_ON
;			0x01		; BUSY_RX
;			0x02		; BUSY_TX
;			0x06		; RX_ON
;			0x08		; TRX_OFF
;			0x09		; PLL_ON
;			0x0F		; SLEEP
;			0x11		; BUSY_RX_AACK
;			0x12		; BUSY_TX_ARET
;			0x16		; RX_AACK_ON
;			0x19		; TX_ARET_ON
;			0x1F		; STATE_TRANSITION_IN_PROGRESS

; ----------	Register TRX_STATE bits		------------------------
.equ	TRAC_STATUS_MASK= 0xE0		;      - Transaction Status (3 bits)
.equ	TRAC_STATUS0	= 5		;          TRAC_STATUS BIT0 position
.equ	TRX_CMD_MASK	= 0x1F		;      - State Control Command (5 bits)
.equ	TRX_CMD0	= 0		;          TRX_CMD BIT0 position
; ::::  TRAC_STATUS	:::: bitfield values
;			0x00		; SUCCESS (RX_AACK, TX_ARET)
;			0x20		; SUCCESS_DATA_PENDING (TX_ARET)
;			0x40		; SUCCESS_WAIT_FOR_ACK (RX_AACK)
;			0x60		; CHANNEL_ACCESS_FAILURE (TX_ARET)
;			0xA0		; NO_ACK (TX_ARET)
;			0xE0		; INVALID (RX_AACK, TX_ARET)
; ::::  TRX_CMD	:::: bitfield values
;			0x00		; NOP
;			0x02		; TX_START
;			0x03		; FORCE_TRX_OFF
;			0x04		; FORCE_PLL_ON
;			0x06		; RX_ON
;			0x08		; TRX_OFF
;			0x09		; PLL_ON (TX_ON)
;			0x16		; RX_AACK_ON
;			0x19		; TX_ARET_ON

; ----------	Register TRX_CTRL_0 bits	------------------------
.equ	TRX_CTRL_0_Res_MASK= 0xFF		;      - Reserved (8 bits)
.equ	TRX_CTRL_0_Res0	= 0		;          TRX_CTRL_0_Res BIT0 position

; ----------	Register TRX_CTRL_1 bits	------------------------
.equ	PA_EXT_EN	= 7		; 0x80 - External PA support enable
.equ	IRQ_2_EXT_EN	= 6		; 0x40 - Connect Frame Start IRQ to TC1
.equ	TX_AUTO_CRC_ON	= 5		; 0x20 - Enable Automatic CRC Calculation
.equ	TRX_CTRL_1_Res_MASK= 0x1F		;      - Reserved (5 bits)
.equ	TRX_CTRL_1_Res0	= 0		;          TRX_CTRL_1_Res BIT0 position

; ----------	Register PHY_TX_PWR bits	------------------------
.equ	PA_BUF_LT_MASK	= 0xC0		;      - Power Amplifier Buffer Lead Time (2 bits)
.equ	PA_BUF_LT0	= 6		;          PA_BUF_LT BIT0 position
.equ	PA_LT_MASK	= 0x30		;      - Power Amplifier Lead Time (2 bits)
.equ	PA_LT0		= 4		;          PA_LT BIT0 position
.equ	TX_PWR_MASK	= 0x0F		;      - Transmit Power Setting (4 bits)
.equ	TX_PWR0		= 0		;          TX_PWR BIT0 position
; ::::  PA_BUF_LT	:::: bitfield values
;			0x00		; 0 us
;			0x40		; 2 us
;			0x80		; 4 us
;			0xC0		; 6 us
; ::::  PA_LT	:::: bitfield values
;			0x00		; 2 us
;			0x10		; 4 us
;			0x20		; 6 us
;			0x30		; 8 us
; ::::  TX_PWR	:::: bitfield values
;			0x00		; 3.0 dBm
;			0x01		; 2.8 dBm
;			0x02		; 2.3 dBm
;			0x03		; 1.8 dBm
;			0x04		; 1.3 dBm
;			0x05		; 0.7 dBm
;			0x06		; 0.0 dBm
;			0x07		;  -1 dBm
;			0x08		;  -2 dBm
;			0x09		;  -3 dBm
;			0x0A		;  -4 dBm
;			0x0B		;  -5 dBm
;			0x0C		;  -7 dBm
;			0x0D		;  -9 dBm
;			0x0E		; -12 dBm
;			0x0F		; -17 dBm

; ----------	Register PHY_RSSI bits		------------------------
.equ	RX_CRC_VALID	= 7		; 0x80 - Received Frame CRC Status
.equ	RND_VALUE_MASK	= 0x60		;      - Random Value (2 bits)
.equ	RND_VALUE0	= 5		;          RND_VALUE BIT0 position
.equ	RSSI_MASK	= 0x1F		;      - Receiver Signal Strength Indicator (5 bits)
.equ	RSSI0		= 0		;          RSSI BIT0 position
; ::::  RX_CRC_VALID	:::: bitfield values
;			0x00		; CRC (FCS) not valid
;			0x80		; CRC (FCS) valid
; ::::  RSSI	:::: bitfield values
;			0x00		; Minimum RSSI value: P(RF) < -90 dBm
;			0x01		; P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]
;			0x02		; ...
;			0x1C		; Maximum RSSI value: P(RF) ≥ -10 dBm

; ----------	Register PHY_ED_LEVEL bits	------------------------
.equ	ED_LEVEL_MASK	= 0xFF		;      - Energy Detection Level (8 bits)
.equ	ED_LEVEL0	= 0		;          ED_LEVEL BIT0 position
; ::::  ED_LEVEL	:::: bitfield values
;			0x00		; Minimum result of last ED measurement
;			0x01		; P(RF) = RSSI_BASE_VAL+ED [dBm]
;			0x02		; ...
;			0x54		; Maximum result of last ED measurement
;			0xFF		; Reset value

; ----------	Register PHY_CC_CCA bits	------------------------
.equ	CCA_REQUEST	= 7		; 0x80 - Manual CCA Measurement Request
.equ	CCA_MODE_MASK	= 0x60		;      - Select CCA Measurement Mode (2 bits)
.equ	CCA_MODE0	= 5		;          CCA_MODE BIT0 position
.equ	CHANNEL_MASK	= 0x1F		;      - RX/TX Channel Selection (5 bits)
.equ	CHANNEL0	= 0		;          CHANNEL BIT0 position
; ::::  CCA_MODE	:::: bitfield values
;			0x00		; Mode 3a, Carrier sense OR energy above threshold
;			0x20		; Mode 1, Energy above threshold
;			0x40		; Mode 2, Carrier sense only
;			0x60		; Mode 3b, Carrier sense AND energy above threshold
; ::::  CHANNEL	:::: bitfield values
;			0x0B		; 2405 MHz
;			0x0C		; 2410 MHz
;			0x0D		; 2415 MHz
;			0x0E		; 2420 MHz
;			0x0F		; 2425 MHz
;			0x10		; 2430 MHz
;			0x11		; 2435 MHz
;			0x12		; 2440 MHz
;			0x13		; 2445 MHz
;			0x14		; 2450 MHz
;			0x15		; 2455 MHz
;			0x16		; 2460 MHz
;			0x17		; 2465 MHz
;			0x18		; 2470 MHz
;			0x19		; 2475 MHz
;			0x1A		; 2480 MHz

; ----------	Register CCA_THRES bits		------------------------
.equ	CCA_CS_THRES_MASK= 0xF0		;      - CS Threshold Level for CCA Measurement (4 bits)
.equ	CCA_CS_THRES0	= 4		;          CCA_CS_THRES BIT0 position
.equ	CCA_ED_THRES_MASK= 0x0F		;      - ED Threshold Level for CCA Measurement (4 bits)
.equ	CCA_ED_THRES0	= 0		;          CCA_ED_THRES BIT0 position

