sterentev/atdf-device-asm-include/inc/ATmega128RFA1.inc
; ----------	Register RX_CTRL bits		------------------------
.equ	PDT_THRES_MASK	= 0x0F		;      - Receiver Sensitivity Control (4 bits)
.equ	PDT_THRES0	= 0		;          PDT_THRES BIT0 position
; ::::  PDT_THRES	:::: bitfield values
;			0x07		; Reset value, to be used if Antenna Diversity algorithm is disabled
;			0x03		; Recommended correlator threshold for Antenna Diversity operation

; ----------	Register SFD_VALUE bits		------------------------
.equ	SFD_VALUE_MASK	= 0xFF		;      - Start of Frame Delimiter Value (8 bits)
.equ	SFD_VALUE0	= 0		;          SFD_VALUE BIT0 position
; ::::  SFD_VALUE	:::: bitfield values
;			0xA7		; IEEE 802.15.4 compliant value of the SFD

; ----------	Register TRX_CTRL_2 bits	------------------------
.equ	RX_SAFE_MODE	= 7		; 0x80 - RX Safe Mode
.equ	TRX_CTRL_2_Res_MASK= 0x7C		;      - Reserved (5 bits)
.equ	TRX_CTRL_2_Res0	= 2		;          TRX_CTRL_2_Res BIT0 position
.equ	OQPSK_DATA_RATE_MASK= 0x03		;      - Data Rate Selection (2 bits)
.equ	OQPSK_DATA_RATE0= 0		;          OQPSK_DATA_RATE BIT0 position
; ::::  OQPSK_DATA_RATE	:::: bitfield values
;			0x00		; 250 kb/s (IEEE 802.15.4 compliant)
;			0x01		; 500 kb/s
;			0x02		; 1000 kb/s
;			0x03		; 2000 kb/s

; ----------	Register ANT_DIV bits		------------------------
.equ	ANT_SEL		= 7		; 0x80 - Antenna Diversity Antenna Status
.equ	ANT_DIV_Res_MASK= 0x70		;      - Reserved (3 bits)
.equ	ANT_DIV_Res0	= 4		;          ANT_DIV_Res BIT0 position
.equ	ANT_DIV_EN	= 3		; 0x08 - Enable Antenna Diversity
.equ	ANT_EXT_SW_EN	= 2		; 0x04 - Enable External Antenna Switch Control
.equ	ANT_CTRL_MASK	= 0x03		;      - Static Antenna Diversity Switch Control (2 bits)
.equ	ANT_CTRL0	= 0		;          ANT_CTRL BIT0 position
; ::::  ANT_SEL	:::: bitfield values
;			0x00		; Antenna 0
;			0x80		; Antenna 1
; ::::  ANT_DIV_EN	:::: bitfield values
;			0x00		; Antenna Diversity algorithm disabled
;			0x08		; Antenna Diversity algorithm enabled
; ::::  ANT_EXT_SW_EN	:::: bitfield values
;			0x00		; Antenna Diversity RF switch control disabled
;			0x04		; Antenna Diversity RF switch control enabled
; ::::  ANT_CTRL	:::: bitfield values
;			0x00		; Reserved
;			0x01		; Antenna 1: DIG1=H, DIG2=L
;			0x02		; Antenna 0: DIG1=L, DIG2=H
;			0x03		; Default value for ANT_EXT_SW_EN=0; Mandatory setting for applications not using Antenna Diversity

; ----------	Register IRQ_MASK bits		------------------------
.equ	AWAKE_EN	= 7		; 0x80 - Awake Interrupt Enable
.equ	TX_END_EN	= 6		; 0x40 - TX_END Interrupt Enable
.equ	AMI_EN		= 5		; 0x20 - Address Match Interrupt Enable
.equ	CCA_ED_DONE_EN	= 4		; 0x10 - End of ED Measurement Interrupt Enable
.equ	RX_END_EN	= 3		; 0x08 - RX_END Interrupt Enable
.equ	RX_START_EN	= 2		; 0x04 - RX_START Interrupt Enable
.equ	PLL_UNLOCK_EN	= 1		; 0x02 - PLL Unlock Interrupt Enable
.equ	PLL_LOCK_EN	= 0		; 0x01 - PLL Lock Interrupt Enable

; ----------	Register IRQ_STATUS bits	------------------------
.equ	AWAKE		= 7		; 0x80 - Awake Interrupt Status
.equ	TX_END		= 6		; 0x40 - TX_END Interrupt Status
.equ	AMI		= 5		; 0x20 - Address Match Interrupt Status
.equ	CCA_ED_DONE	= 4		; 0x10 - End of ED Measurement Interrupt Status
.equ	RX_END		= 3		; 0x08 - RX_END Interrupt Status
.equ	RX_START	= 2		; 0x04 - RX_START Interrupt Status
.equ	PLL_UNLOCK	= 1		; 0x02 - PLL Unlock Interrupt Status
.equ	PLL_LOCK	= 0		; 0x01 - PLL Lock Interrupt Status

; ----------	Register VREG_CTRL bits		------------------------
.equ	AVREG_EXT	= 7		; 0x80 - Use External AVDD Regulator
.equ	AVDD_OK		= 6		; 0x40 - AVDD Supply Voltage Valid
.equ	DVREG_EXT	= 3		; 0x08 - Use External DVDD Regulator
.equ	DVDD_OK		= 2		; 0x04 - DVDD Supply Voltage Valid
; ::::  AVREG_EXT	:::: bitfield values
;			0x00		; Internal AVDD voltage regulator for the analog section is enabled.
;			0x80		; Internal AVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the analog section.
; ::::  AVDD_OK	:::: bitfield values
;			0x00		; Analog voltage regulator disabled or supply voltage not stable
;			0x40		; Analog supply voltage has settled
; ::::  DVREG_EXT	:::: bitfield values
;			0x00		; Internal DVDD voltage regulator for the digital section is enabled.
;			0x08		; Internal DVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the digital section.
; ::::  DVDD_OK	:::: bitfield values
;			0x00		; Digital voltage regulator disabled or supply voltage not stable
;			0x04		; Digital supply voltage has settled

; ----------	Register BATMON bits		------------------------
.equ	BAT_LOW		= 7		; 0x80 - Battery Monitor Interrupt Status
.equ	BAT_LOW_EN	= 6		; 0x40 - Battery Monitor Interrupt Enable
.equ	BATMON_OK	= 5		; 0x20 - Battery Monitor Status
.equ	BATMON_HR	= 4		; 0x10 - Battery Monitor Voltage Range
.equ	BATMON_VTH_MASK	= 0x0F		;      - Battery Monitor Threshold Voltage (4 bits)
.equ	BATMON_VTH0	= 0		;          BATMON_VTH BIT0 position
; ::::  BATMON_OK	:::: bitfield values
;			0x00		; The battery voltage is below the threshold.
;			0x20		; The battery voltage is above the threshold.
; ::::  BATMON_HR	:::: bitfield values
;			0x00		; Enables the low range, see BATMON_VTH
;			0x10		; Enables the high range, see BATMON_VTH
; ::::  BATMON_VTH	:::: bitfield values
;			0x00		; 2.550V (BATMON_HR=1) 1.70V (BATMON_HR=0)
;			0x01		; 2.625V (BATMON_HR=1) 1.75V (BATMON_HR=0)
;			0x02		; 2.700V (BATMON_HR=1) 1.80V (BATMON_HR=0)
;			0x03		; 2.775V (BATMON_HR=1) 1.85V (BATMON_HR=0)
;			0x04		; 2.850V (BATMON_HR=1) 1.90V (BATMON_HR=0)
;			0x05		; 2.925V (BATMON_HR=1) 1.95V (BATMON_HR=0)
;			0x06		; 3.000V (BATMON_HR=1) 2.00V (BATMON_HR=0)
;			0x07		; 3.075V (BATMON_HR=1) 2.05V (BATMON_HR=0)
;			0x08		; 3.150V (BATMON_HR=1) 2.10V (BATMON_HR=0)
;			0x09		; 3.225V (BATMON_HR=1) 2.15V (BATMON_HR=0)
;			0x0A		; 3.300V (BATMON_HR=1) 2.20V (BATMON_HR=0)
;			0x0B		; 3.375V (BATMON_HR=1) 2.25V (BATMON_HR=0)
;			0x0C		; 3.450V (BATMON_HR=1) 2.30V (BATMON_HR=0)
;			0x0D		; 3.525V (BATMON_HR=1) 2.35V (BATMON_HR=0)
;			0x0E		; 3.600V (BATMON_HR=1) 2.40V (BATMON_HR=0)
;			0x0F		; 3.675V (BATMON_HR=1) 2.45V (BATMON_HR=0)

; ----------	Register XOSC_CTRL bits		------------------------
.equ	XTAL_MODE_MASK	= 0xF0		;      - Crystal Oscillator Operating Mode (4 bits)
.equ	XTAL_MODE0	= 4		;          XTAL_MODE BIT0 position
.equ	XTAL_TRIM_MASK	= 0x0F		;      - Crystal Oscillator Load Capacitance Trimming (4 bits)
.equ	XTAL_TRIM0	= 0		;          XTAL_TRIM BIT0 position
; ::::  XTAL_MODE	:::: bitfield values
;			0x40		; Internal crystal oscillator disabled; use external reference frequency.
;			0xF0		; Internal crystal oscillator enabled; amplitude regulation of oscillation enabled.
; ::::  XTAL_TRIM	:::: bitfield values
;			0x00		; 0.0 pF, trimming capacitors disconnected
;			0x01		; 0.3 pF, trimming capacitor switched on
;			0x02		; ...
;			0x0F		; 4.5 pF, trimming capacitor switched on

