sterentev/atdf-device-asm-include/inc/ATmega128RFA1.inc
; ----------	Register CSMA_SEED_1 bits	------------------------
.equ	AACK_FVN_MODE_MASK= 0xC0		;      - Acknowledgment Frame Filter Mode (2 bits)
.equ	AACK_FVN_MODE0	= 6		;          AACK_FVN_MODE BIT0 position
.equ	AACK_SET_PD	= 5		; 0x20 - Set Frame Pending Sub-field
.equ	AACK_DIS_ACK	= 4		; 0x10 - Disable Acknowledgment Frame Transmission
.equ	AACK_I_AM_COORD	= 3		; 0x08 - Set Personal Area Network Coordinator
.equ	CSMA_SEED_1_MASK= 0x07		;      - Seed Value for CSMA Random Number Generator (3 bits)
.equ	CSMA_SEED_10	= 0		;          CSMA_SEED_1 BIT0 position
; ::::  AACK_FVN_MODE	:::: bitfield values
;			0x00		; Acknowledge frames with version number 0
;			0x40		; Acknowledge frames with version number 0 or 1
;			0x80		; Acknowledge frames with version number 0 or 1 or 2
;			0xC0		; Acknowledge frames independent of frame version number

; ----------	Register CSMA_BE bits		------------------------
.equ	MAX_BE_MASK	= 0xF0		;      - Maximum Back-off Exponent (4 bits)
.equ	MAX_BE0		= 4		;          MAX_BE BIT0 position
.equ	MIN_BE_MASK	= 0x0F		;      - Minimum Back-off Exponent (4 bits)
.equ	MIN_BE0		= 0		;          MIN_BE BIT0 position
; ::::  MAX_BE	:::: bitfield values
;			0x10		; This value is not valid for the maximum back-off exponent.
;			0x20		; This value is not valid for the maximum back-off exponent.
;			0x30		; Minimum, IEEE compliant value for the maximum back-off exponent.
;			0x40		; ...
;			0x80		; Maximum, IEEE compliant value for the maximum back-off exponent.
; ::::  MIN_BE	:::: bitfield values
;			0x00		; Minimum value of minimum back-off exponent.
;			0x01		; ...
;			0x08		; Maximum value of minimum back-off exponent. MIN_BE must be smaller or equal to MAX_BE.

; ----------	Register TST_CTRL_DIGI bits	------------------------
.equ	TST_CTRL_DIG_MASK= 0x0F		;      - Digital Test Controller Register (4 bits)
.equ	TST_CTRL_DIG0	= 0		;          TST_CTRL_DIG BIT0 position
; ::::  TST_CTRL_DIG	:::: bitfield values
;			0x00		; NORMAL (no test is active)
;			0x0F		; TST_CONT_TX (continuous transmit)

; ----------	Register TST_RX_LENGTH bits	------------------------
.equ	RX_LENGTH_MASK	= 0xFF		;      - Received Frame Length (8 bits)
.equ	RX_LENGTH0	= 0		;          RX_LENGTH BIT0 position



; ====	SYMCNT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SCOCR1HH bits		------------------------
.equ	SCOCR1HH_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 1 HH-Byte (8 bits)
.equ	SCOCR1HH0	= 0		;          SCOCR1HH BIT0 position

; ----------	Register SCOCR1HL bits		------------------------
.equ	SCOCR1HL_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 1 HL-Byte (8 bits)
.equ	SCOCR1HL0	= 0		;          SCOCR1HL BIT0 position

; ----------	Register SCOCR1LH bits		------------------------
.equ	SCOCR1LH_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 1 LH-Byte (8 bits)
.equ	SCOCR1LH0	= 0		;          SCOCR1LH BIT0 position

; ----------	Register SCOCR1LL bits		------------------------
.equ	SCOCR1LL_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 1 LL-Byte (8 bits)
.equ	SCOCR1LL0	= 0		;          SCOCR1LL BIT0 position

; ----------	Register SCOCR2HH bits		------------------------
.equ	SCOCR2HH_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 2 HH-Byte (8 bits)
.equ	SCOCR2HH0	= 0		;          SCOCR2HH BIT0 position

; ----------	Register SCOCR2HL bits		------------------------
.equ	SCOCR2HL_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 2 HL-Byte (8 bits)
.equ	SCOCR2HL0	= 0		;          SCOCR2HL BIT0 position

; ----------	Register SCOCR2LH bits		------------------------
.equ	SCOCR2LH_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 2 LH-Byte (8 bits)
.equ	SCOCR2LH0	= 0		;          SCOCR2LH BIT0 position

; ----------	Register SCOCR2LL bits		------------------------
.equ	SCOCR2LL_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 2 LL-Byte (8 bits)
.equ	SCOCR2LL0	= 0		;          SCOCR2LL BIT0 position

; ----------	Register SCOCR3HH bits		------------------------
.equ	SCOCR3HH_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 3 HH-Byte (8 bits)
.equ	SCOCR3HH0	= 0		;          SCOCR3HH BIT0 position

; ----------	Register SCOCR3HL bits		------------------------
.equ	SCOCR3HL_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 3 HL-Byte (8 bits)
.equ	SCOCR3HL0	= 0		;          SCOCR3HL BIT0 position

; ----------	Register SCOCR3LH bits		------------------------
.equ	SCOCR3LH_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 3 LH-Byte (8 bits)
.equ	SCOCR3LH0	= 0		;          SCOCR3LH BIT0 position

; ----------	Register SCOCR3LL bits		------------------------
.equ	SCOCR3LL_MASK	= 0xFF		;      - Symbol Counter Output Compare Register 3 LL-Byte (8 bits)
.equ	SCOCR3LL0	= 0		;          SCOCR3LL BIT0 position

; ----------	Register SCTSRHH bits		------------------------
.equ	SCTSRHH_MASK	= 0xFF		;      - Symbol Counter Frame Timestamp Register HH-Byte (8 bits)
.equ	SCTSRHH0	= 0		;          SCTSRHH BIT0 position

; ----------	Register SCTSRHL bits		------------------------
.equ	SCTSRHL_MASK	= 0xFF		;      - Symbol Counter Frame Timestamp Register HL-Byte (8 bits)
.equ	SCTSRHL0	= 0		;          SCTSRHL BIT0 position

; ----------	Register SCTSRLH bits		------------------------
.equ	SCTSRLH_MASK	= 0xFF		;      - Symbol Counter Frame Timestamp Register LH-Byte (8 bits)
.equ	SCTSRLH0	= 0		;          SCTSRLH BIT0 position

; ----------	Register SCTSRLL bits		------------------------
.equ	SCTSRLL_MASK	= 0xFF		;      - Symbol Counter Frame Timestamp Register LL-Byte (8 bits)
.equ	SCTSRLL0	= 0		;          SCTSRLL BIT0 position

; ----------	Register SCBTSRHH bits		------------------------
.equ	SCBTSRHH_MASK	= 0xFF		;      - Symbol Counter Beacon Timestamp Register HH-Byte (8 bits)
.equ	SCBTSRHH0	= 0		;          SCBTSRHH BIT0 position

; ----------	Register SCBTSRHL bits		------------------------
.equ	SCBTSRHL_MASK	= 0xFF		;      - Symbol Counter Beacon Timestamp Register HL-Byte (8 bits)
.equ	SCBTSRHL0	= 0		;          SCBTSRHL BIT0 position

; ----------	Register SCBTSRLH bits		------------------------
.equ	SCBTSRLH_MASK	= 0xFF		;      - Symbol Counter Beacon Timestamp Register LH-Byte (8 bits)
.equ	SCBTSRLH0	= 0		;          SCBTSRLH BIT0 position

; ----------	Register SCBTSRLL bits		------------------------
.equ	SCBTSRLL_MASK	= 0xFF		;      - Symbol Counter Beacon Timestamp Register LL-Byte (8 bits)
.equ	SCBTSRLL0	= 0		;          SCBTSRLL BIT0 position

