sterentev/atdf-device-asm-include/inc/ATmega128RFA1.inc
; ----------	Register SCCNTHH bits		------------------------
.equ	SCCNTHH_MASK	= 0xFF		;      - Symbol Counter Register HH-Byte (8 bits)
.equ	SCCNTHH0	= 0		;          SCCNTHH BIT0 position

; ----------	Register SCCNTHL bits		------------------------
.equ	SCCNTHL_MASK	= 0xFF		;      - Symbol Counter Register HL-Byte (8 bits)
.equ	SCCNTHL0	= 0		;          SCCNTHL BIT0 position

; ----------	Register SCCNTLH bits		------------------------
.equ	SCCNTLH_MASK	= 0xFF		;      - Symbol Counter Register LH-Byte (8 bits)
.equ	SCCNTLH0	= 0		;          SCCNTLH BIT0 position

; ----------	Register SCCNTLL bits		------------------------
.equ	SCCNTLL_MASK	= 0xFF		;      - Symbol Counter Register LL-Byte (8 bits)
.equ	SCCNTLL0	= 0		;          SCCNTLL BIT0 position

; ----------	Register SCIRQS bits		------------------------
.equ	SCIRQS_Res_MASK	= 0xE0		;      - Reserved Bit (3 bits)
.equ	SCIRQS_Res0	= 5		;          SCIRQS_Res BIT0 position
.equ	IRQSBO		= 4		; 0x10 - Backoff Slot Counter IRQ
.equ	IRQSOF		= 3		; 0x08 - Symbol Counter Overflow IRQ
.equ	IRQSCP_MASK	= 0x07		;      - Compare Unit 3 Compare Match IRQ (3 bits)
.equ	IRQSCP0		= 0		;          IRQSCP BIT0 position

; ----------	Register SCIRQM bits		------------------------
.equ	SCIRQM_Res_MASK	= 0xE0		;      - Reserved Bit (3 bits)
.equ	SCIRQM_Res0	= 5		;          SCIRQM_Res BIT0 position
.equ	IRQMBO		= 4		; 0x10 - Backoff Slot Counter IRQ enable
.equ	IRQMOF		= 3		; 0x08 - Symbol Counter Overflow IRQ enable
.equ	IRQMCP_MASK	= 0x07		;      - Symbol Counter Compare Match 3 IRQ enable (3 bits)
.equ	IRQMCP0		= 0		;          IRQMCP BIT0 position

; ----------	Register SCSR bits		------------------------
.equ	SCSR_Res_MASK	= 0xFE		;      - Reserved Bit (7 bits)
.equ	SCSR_Res0	= 1		;          SCSR_Res BIT0 position
.equ	SCBSY		= 0		; 0x01 - Symbol Counter busy

; ----------	Register SCCR1 bits		------------------------
.equ	SCCR1_Res_MASK	= 0xFE		;      - Reserved Bit (7 bits)
.equ	SCCR1_Res0	= 1		;          SCCR1_Res BIT0 position
.equ	SCENBO		= 0		; 0x01 - Backoff Slot Counter enable

; ----------	Register SCCR0 bits		------------------------
.equ	SCRES		= 7		; 0x80 - Symbol Counter Synchronization
.equ	SCMBTS		= 6		; 0x40 - Manual Beacon Timestamp
.equ	SCEN		= 5		; 0x20 - Symbol Counter enable
.equ	SCCKSEL		= 4		; 0x10 - Symbol Counter Clock Source select
.equ	SCTSE		= 3		; 0x08 - Symbol Counter Automatic Timestamping enable
.equ	SCCMP_MASK	= 0x07		;      - Symbol Counter Compare Unit 3 Mode select (3 bits)
.equ	SCCMP0		= 0		;          SCCMP BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EECR_Res_MASK	= 0xC0		;      - Reserved (2 bits)
.equ	EECR_Res0	= 6		;          EECR_Res BIT0 position
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Programming Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation (Atomic Operation)
;			0x10		; Erase only
;			0x20		; Write only
;			0x30		; Reserved for future use



; ====	JTAG MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register OCDR bits		------------------------
.equ	OCDR_MASK	= 0xFF		;      - On-Chip Debug Register Data (8 bits)
.equ	OCDR0		= 0		;          OCDR BIT0 position
; ::::  OCDR	:::: bitfield values
;			0x00		; Refer to the debugger documentation for further information on how to use this register.

; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable

; ----------	Register MCUSR bits		------------------------
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt 3 Sense Control Bit (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt 2 Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt 1 Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt 0 Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x40		; Any edge of INTn generates asynchronously an interrupt request.
;			0x80		; The falling edge of INTn generates asynchronously an interrupt request.
;			0xC0		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC2	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x10		; Any edge of INTn generates asynchronously an interrupt request.
;			0x20		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x30		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC1	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x04		; Any edge of INTn generates asynchronously an interrupt request.
;			0x08		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x0C		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC0	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x01		; Any edge of INTn generates asynchronously an interrupt request.
;			0x02		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x03		; The rising edge of INTn generates asynchronously an interrupt request.

; ----------	Register EICRB bits		------------------------
.equ	ISC7_MASK	= 0xC0		;      - External Interrupt 7 Sense Control Bit (2 bits)
.equ	ISC70		= 6		;          ISC7 BIT0 position
.equ	ISC6_MASK	= 0x30		;      - External Interrupt 6 Sense Control Bit (2 bits)
.equ	ISC60		= 4		;          ISC6 BIT0 position
.equ	ISC5_MASK	= 0x0C		;      - External Interrupt 5 Sense Control Bit (2 bits)
.equ	ISC50		= 2		;          ISC5 BIT0 position
.equ	ISC4_MASK	= 0x03		;      - External Interrupt 4 Sense Control Bit (2 bits)
.equ	ISC40		= 0		;          ISC4 BIT0 position
; ::::  ISC7	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x40		; Any edge of INTn generates asynchronously an interrupt request.
;			0x80		; The falling edge of INTn generates asynchronously an interrupt request.
;			0xC0		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC6	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x10		; Any edge of INTn generates asynchronously an interrupt request.
;			0x20		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x30		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC5	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x04		; Any edge of INTn generates asynchronously an interrupt request.
;			0x08		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x0C		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC4	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x01		; Any edge of INTn generates asynchronously an interrupt request.
;			0x02		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x03		; The rising edge of INTn generates asynchronously an interrupt request.

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0xFF		;      - External Interrupt Request Enable (8 bits)
.equ	INT0		= 0		;          INT BIT0 position
; ::::  INT	:::: bitfield values
;			0x00		; All external pin interrupts are disabled.
;			0xFF		; All external pin interrupts are enabled.

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0xFF		;      - External Interrupt Flag (8 bits)
.equ	INTF0		= 0		;          INTF BIT0 position
; ::::  INTF	:::: bitfield values
;			0x00		; No edge or logic change on INT7:0 occurred.
;			0x01		; A edge or logic change on INT0 occurred and triggered an interrupt request.
;			0x02		; ...
;			0x80		; A edge or logic change on INT7 occurred and triggered an interrupt request.

