sterentev/atdf-device-asm-include/inc/ATmega128RFA1.inc
; ----------	Register PCMSK2 bits		------------------------
.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK1 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIFR_Res_MASK	= 0xF8		;      - Reserved Bit (5 bits)
.equ	PCIFR_Res0	= 3		;          PCIFR_Res BIT0 position
.equ	PCIF_MASK	= 0x07		;      - Pin Change Interrupt Flags (3 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position

; ----------	Register PCICR bits		------------------------
.equ	PCICR_Res_MASK	= 0xF8		;      - Reserved Bit (5 bits)
.equ	PCICR_Res0	= 3		;          PCICR_Res BIT0 position
.equ	PCIE_MASK	= 0x07		;      - Pin Change Interrupt Enables (3 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - ADC Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal reference voltage generation turned off
;			0x40		; AVDD with external capacitor at AREF pin
;			0x80		; Internal 1.5V Voltage Reference (no external capacitor at AREF pin)
;			0xC0		; Internal 1.6V Voltage Reference (no external capacitor at AREF pin)

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	AVDDOK		= 7		; 0x80 - AVDD Supply Voltage OK
;.equ	ACME		= 6		; 0x40 - Analog Comparator Multiplexer Enable
.equ	REFOK		= 5		; 0x20 - Reference Voltage OK
.equ	ACCH		= 4		; 0x10 - Analog Channel Change
.equ	MUX5		= 3		; 0x08 - Analog Channel and Gain Selection Bits
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Source (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event

; ----------	Register ADCSRC bits		------------------------
.equ	ADTHT_MASK	= 0xC0		;      - ADC Track-and-Hold Time (2 bits)
.equ	ADTHT0		= 6		;          ADTHT BIT0 position
.equ	Res0		= 5		; 0x20 - Reserved
.equ	ADSUT_MASK	= 0x1F		;      - ADC Start-up Time (5 bits)
.equ	ADSUT0		= 0		;          ADSUT BIT0 position
; ::::  ADTHT	:::: bitfield values
;			0x00		; Single ended: 1, differential 3 ADC clock cycles
;			0x40		; Single ended: 2, differential 5 ADC clock cycles
;			0x80		; Single ended: 3, differential 7 ADC clock cycles
;			0xC0		; Single ended: 4, differential 9 ADC clock cycles
; ::::  ADSUT	:::: bitfield values
;			0x00		; 3 ADC clock cycles
;			0x01		; 7 ADC clock cycles
;			0x02		; 11 ADC clock cycles
;			0x03		; 15 ADC clock cycles
;			0x04		; ...
;			0x1E		; 251 ADC clock cycles
;			0x1F		; 255 ADC clock cycles

; ----------	Register DIDR2 bits		------------------------
.equ	ADC15D		= 7		; 0x80 - Reserved Bits
.equ	ADC14D		= 6		; 0x40 - Reserved Bits
.equ	ADC13D		= 5		; 0x20 - Reserved Bits
.equ	ADC12D		= 4		; 0x10 - Reserved Bits
.equ	ADC11D		= 3		; 0x08 - Reserved Bits
.equ	ADC10D		= 2		; 0x04 - Reserved Bits
.equ	ADC9D		= 1		; 0x02 - Reserved Bits
.equ	ADC8D		= 0		; 0x01 - Reserved Bits

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - Disable ADC7:0 Digital Input
.equ	ADC6D		= 6		; 0x40 - Disable ADC7:0 Digital Input
.equ	ADC5D		= 5		; 0x20 - Disable ADC7:0 Digital Input
.equ	ADC4D		= 4		; 0x10 - Disable ADC7:0 Digital Input
.equ	ADC3D		= 3		; 0x08 - Disable ADC7:0 Digital Input
.equ	ADC2D		= 2		; 0x04 - Disable ADC7:0 Digital Input
.equ	ADC1D		= 1		; 0x02 - Disable ADC7:0 Digital Input
.equ	ADC0D		= 0		; 0x01 - Disable ADC7:0 Digital Input



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write Section Read Enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
;.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	PUD		= 4		; 0x10 - Pull-up Disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	MCUSR_Res_MASK	= 0xE0		;      - Reserved (3 bits)
.equ	MCUSR_Res0	= 5		;          MCUSR_Res BIT0 position
;.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on Reset Flag

; ----------	Register OSCCAL bits		------------------------
.equ	CAL_MASK	= 0xFF		;      - Oscillator Calibration Tuning Value (8 bits)
.equ	CAL0		= 0		;          CAL BIT0 position
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position
; ::::  CAL	:::: bitfield values
;			0x00		; Calibration value for lowest oscillator frequency
;			0x7F		; End value of low frequency range calibration
;			0x80		; Start value of high frequency range calibration
;			0xFF		; Calibration value for highest oscillator frequency

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPR_Res_MASK	= 0x70		;      - Reserved (3 bits)
.equ	CLKPR_Res0	= 4		;          CLKPR_Res BIT0 position
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; Division factor 1   / RC-Oscillator   2
;			0x01		; Division factor 2   / RC-Oscillator   4
;			0x02		; Division factor 4   / RC-Oscillator   8
;			0x03		; Division factor 8   / RC-Oscillator  16
;			0x04		; Division factor 16  / RC-Oscillator  32
;			0x05		; Division factor 32  / RC-Oscillator  64
;			0x06		; Division factor 64  / RC-Oscillator 128
;			0x07		; Division factor 128 / RC-Oscillator 256
;			0x08		; Division factor 256 / RC-Oscillator 512
;			0x09		; Reserved
;			0x0A		; Reserved
;			0x0B		; Reserved
;			0x0C		; Reserved
;			0x0D		; Reserved
;			0x0E		; Reserved
;			0x0F		; Division factor 1 only permitted for RC-Oscillator. Flash and EEPROM programming is not allowed.

; ----------	Register SMCR bits		------------------------
.equ	SMCR_Res_MASK	= 0xF0		;      - Reserved (4 bits)
.equ	SMCR_Res0	= 4		;          SMCR_Res BIT0 position
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby

; ----------	Register RAMPZ bits		------------------------
.equ	RAMPZ_Res_MASK	= 0xFC		;      - Reserved (6 bits)
.equ	RAMPZ_Res0	= 2		;          RAMPZ_Res BIT0 position
.equ	RAMPZ_MASK	= 0x03		;      - Extended Z-Pointer Value (2 bits)
.equ	RAMPZ0		= 0		;          RAMPZ BIT0 position
; ::::  RAMPZ	:::: bitfield values
;			0x00		; Default value of Z-pointer MSB's.

