sterentev/atdf-device-asm-include/inc/ATmega128RFA1.inc
; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  USART_CHAR_SIZE_BITF	:::: values
;			0b000		; 5-bit
;			0b001		; 6-bit
;			0b010		; 7-bit
;			0b011		; 8-bit
;			0b100		; Reserved
;			0b101		; Reserved
;			0b110		; Reserved
;			0b111		; 9-bit
; ::::  USART_CHAR_SIZE_BITF	:::: values
;			0b000		; 5-bit
;			0b001		; 6-bit
;			0b010		; 7-bit
;			0b011		; 8-bit
;			0b100		; Reserved
;			0b101		; Reserved
;			0b110		; Reserved
;			0b111		; 9-bit
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  TC0_WGM_BITF	:::: values
;			0b000		; Normal mode of operation
;			0b001		; PWM, phase correct, TOP=0xFF
;			0b010		; CTC, TOP = OCRA
;			0b011		; Fast PWM, TOP=0xFF
;			0b100		; Reserved
;			0b101		; PWM, Phase correct, TOP = OCRA
;			0b110		; Reserved
;			0b111		; Fast PWM, TOP=OCRA
; ::::  TC1_WGMX_BITF	:::: values
;			0b0000		; Normal mode of operation
;			0b0001		; PWM, phase correct, 8-bit
;			0b0010		; PWM, phase correct, 9-bit
;			0b0011		; PWM, phase correct, 10-bit
;			0b0100		; CTC, TOP = OCRnA
;			0b0101		; Fast PWM, 8-bit
;			0b0110		; Fast PWM, 9-bit
;			0b0111		; Fast PWM, 10-bit
;			0b1000		; PWM, Phase and frequency correct, TOP = ICRn
;			0b1001		; PWM, Phase and frequency correct, TOP = OCRnA
;			0b1010		; PWM, Phase correct, TOP = ICRn
;			0b1011		; PWM, Phase correct, TOP = OCRnA
;			0b1100		; CTC, TOP = OCRnA
;			0b1101		; Reserved
;			0b1110		; Fast PWM, TOP = ICRn
;			0b1111		; Fast PWM, TOP = OCRnA



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 72
.equ	INT_VECTORS_SIZE	= 0x90
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	INT3		; External Interrupt Request 3
;	5	INT4		; External Interrupt Request 4
;	6	INT5		; External Interrupt Request 5
;	7	INT6		; External Interrupt Request 6
;	8	INT7		; External Interrupt Request 7
;	9	PCINT0		; Pin Change Interrupt Request 0
;	10	PCINT1		; Pin Change Interrupt Request 1
;	11	PCINT2		; Pin Change Interrupt Request 2
;	12	WDT		; Watchdog Time-out Interrupt
;	13	TIMER2_COMPA	; Timer/Counter2 Compare Match A
;	14	TIMER2_COMPB	; Timer/Counter2 Compare Match B
;	15	TIMER2_OVF	; Timer/Counter2 Overflow
;	16	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	17	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	18	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	19	TIMER1_COMPC	; Timer/Counter1 Compare Match C
;	20	TIMER1_OVF	; Timer/Counter1 Overflow
;	21	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	22	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	23	TIMER0_OVF	; Timer/Counter0 Overflow
;	24	SPI_STC		; SPI Serial Transfer Complete
;	25	USART0_RX	; USART0, Rx Complete
;	26	USART0_UDRE	; USART0 Data register Empty
;	27	USART0_TX	; USART0, Tx Complete
;	28	ANALOG_COMP	; Analog Comparator
;	29	ADC		; ADC Conversion Complete
;	30	EE_READY	; EEPROM Ready
;	31	TIMER3_CAPT	; Timer/Counter3 Capture Event
;	32	TIMER3_COMPA	; Timer/Counter3 Compare Match A
;	33	TIMER3_COMPB	; Timer/Counter3 Compare Match B
;	34	TIMER3_COMPC	; Timer/Counter3 Compare Match C
;	35	TIMER3_OVF	; Timer/Counter3 Overflow
;	36	USART1_RX	; USART1, Rx Complete
;	37	USART1_UDRE	; USART1 Data register Empty
;	38	USART1_TX	; USART1, Tx Complete
;	39	TWI		; 2-wire Serial Interface
;	40	SPM_READY	; Store Program Memory Read
;	41	TIMER4_CAPT	; Timer/Counter4 Capture Event
;	42	TIMER4_COMPA	; Timer/Counter4 Compare Match A
;	43	TIMER4_COMPB	; Timer/Counter4 Compare Match B
;	44	TIMER4_COMPC	; Timer/Counter4 Compare Match C
;	45	TIMER4_OVF	; Timer/Counter4 Overflow
;	46	TIMER5_CAPT	; Timer/Counter5 Capture Event
;	47	TIMER5_COMPA	; Timer/Counter5 Compare Match A
;	48	TIMER5_COMPB	; Timer/Counter5 Compare Match B
;	49	TIMER5_COMPC	; Timer/Counter5 Compare Match C
;	50	TIMER5_OVF	; Timer/Counter5 Overflow
;	51	USART2_RX	; USART2, Rx Complete
;	52	USART2_UDRE	; USART2 Data register Empty
;	53	USART2_TX	; USART2, Tx Complete
;	54	USART3_RX	; USART3, Rx Complete
;	55	USART3_UDRE	; USART3 Data register Empty
;	56	USART3_TX	; USART3, Tx Complete
;	57	TRX24_PLL_LOCK	; TRX24 - PLL lock interrupt
;	58	TRX24_PLL_UNLOCK; TRX24 - PLL unlock interrupt
;	59	TRX24_RX_START	; TRX24 - Receive start interrupt
;	60	TRX24_RX_END	; TRX24 - RX_END interrupt
;	61	TRX24_CCA_ED_DONE; TRX24 - CCA/ED done interrupt
;	62	TRX24_XAH_AMI	; TRX24 - XAH - AMI
;	63	TRX24_TX_END	; TRX24 - TX_END interrupt
;	64	TRX24_AWAKE	; TRX24 AWAKE - transceiver is reaching state TRX_OFF
;	65	SCNT_CMP1	; Symbol counter - compare match 1 interrupt
;	66	SCNT_CMP2	; Symbol counter - compare match 2 interrupt
;	67	SCNT_CMP3	; Symbol counter - compare match 3 interrupt
;	68	SCNT_OVFL	; Symbol counter - overflow interrupt
;	69	SCNT_BACKOFF	; Symbol counter - backoff interrupt
;	70	AES_READY	; AES engine ready interrupt
;	71	BAT_LOW		; Battery monitor indicates supply voltage below threshold



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATmega128RFA1.inc"
;#	
;#	; FUSES EXTENDED byte (addr 0x02)
;#	.set	BODLEVEL	= 0x07	; Brown-out detection disabled
;#	.set	FUSES_EXTENDED	= 0xFF \
;#				  &  (~BODLEVEL_MASK | BODLEVEL)
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BOOTSZ		= 0x02	; Boot Flash size=2048 words start address=$F800
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<OCDEN) \
;#				  & ~(1 <<JTAGEN) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	CKSEL_SUT	= 0x22	; Int. RC Osc.; Start-up time: 6 CK + 65 ms
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(1 <<CKDIV8) \
;#				  & ~(0 <<CKOUT) \
;#				  &  (~CKSEL_SUT_MASK | CKSEL_SUT)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "EXTENDED	", FUSES_EXTENDED
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		reti			; INT4		 - External Interrupt Request 4
;#		reti			; INT5		 - External Interrupt Request 5
;#		reti			; INT6		 - External Interrupt Request 6
;#		reti			; INT7		 - External Interrupt Request 7
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER2_COMPA	 - Timer/Counter2 Compare Match A
;#		reti			; TIMER2_COMPB	 - Timer/Counter2 Compare Match B
;#		reti			; TIMER2_OVF	 - Timer/Counter2 Overflow
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_COMPC	 - Timer/Counter1 Compare Match C
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART0_RX	 - USART0, Rx Complete
;#		reti			; USART0_UDRE	 - USART0 Data register Empty
;#		reti			; USART0_TX	 - USART0, Tx Complete
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; TIMER3_CAPT	 - Timer/Counter3 Capture Event
;#		reti			; TIMER3_COMPA	 - Timer/Counter3 Compare Match A
;#		reti			; TIMER3_COMPB	 - Timer/Counter3 Compare Match B
;#		reti			; TIMER3_COMPC	 - Timer/Counter3 Compare Match C
;#		reti			; TIMER3_OVF	 - Timer/Counter3 Overflow
;#		reti			; USART1_RX	 - USART1, Rx Complete
;#		reti			; USART1_UDRE	 - USART1 Data register Empty
;#		reti			; USART1_TX	 - USART1, Tx Complete
;#		reti			; TWI		 - 2-wire Serial Interface
;#		reti			; SPM_READY	 - Store Program Memory Read
;#		reti			; TIMER4_CAPT	 - Timer/Counter4 Capture Event
;#		reti			; TIMER4_COMPA	 - Timer/Counter4 Compare Match A
;#		reti			; TIMER4_COMPB	 - Timer/Counter4 Compare Match B
;#		reti			; TIMER4_COMPC	 - Timer/Counter4 Compare Match C
;#		reti			; TIMER4_OVF	 - Timer/Counter4 Overflow
;#		reti			; TIMER5_CAPT	 - Timer/Counter5 Capture Event
;#		reti			; TIMER5_COMPA	 - Timer/Counter5 Compare Match A
;#		reti			; TIMER5_COMPB	 - Timer/Counter5 Compare Match B
;#		reti			; TIMER5_COMPC	 - Timer/Counter5 Compare Match C
;#		reti			; TIMER5_OVF	 - Timer/Counter5 Overflow
;#		reti			; USART2_RX	 - USART2, Rx Complete
;#		reti			; USART2_UDRE	 - USART2 Data register Empty
;#		reti			; USART2_TX	 - USART2, Tx Complete
;#		reti			; USART3_RX	 - USART3, Rx Complete
;#		reti			; USART3_UDRE	 - USART3 Data register Empty
;#		reti			; USART3_TX	 - USART3, Tx Complete
;#		reti			; TRX24_PLL_LOCK - TRX24 - PLL lock interrupt
;#		reti			; TRX24_PLL_UNLOCK - TRX24 - PLL unlock interrupt
;#		reti			; TRX24_RX_START - TRX24 - Receive start interrupt
;#		reti			; TRX24_RX_END	 - TRX24 - RX_END interrupt
;#		reti			; TRX24_CCA_ED_DONE - TRX24 - CCA/ED done interrupt
;#		reti			; TRX24_XAH_AMI	 - TRX24 - XAH - AMI
;#		reti			; TRX24_TX_END	 - TRX24 - TX_END interrupt
;#		reti			; TRX24_AWAKE	 - TRX24 AWAKE - transceiver is reaching state TRX_OFF
;#		reti			; SCNT_CMP1	 - Symbol counter - compare match 1 interrupt
;#		reti			; SCNT_CMP2	 - Symbol counter - compare match 2 interrupt
;#		reti			; SCNT_CMP3	 - Symbol counter - compare match 3 interrupt
;#		reti			; SCNT_OVFL	 - Symbol counter - overflow interrupt
;#		reti			; SCNT_BACKOFF	 - Symbol counter - backoff interrupt
;#		reti			; AES_READY	 - AES engine ready interrupt
;#		reti			; BAT_LOW	 - Battery monitor indicates supply voltage below threshold
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA128RFA1_INC_ */

; ************************ END OF FILE *********************************

